sifive_p870/data/fio.txt
evb2-test@evb2-test:~/fio$ fio --name=nvme_profile_mounted --filename=fio_testfile --direct=1 --ioengine=libaio --rw=randrw --rwmixread=70 --bs=4k --iodepth=64 --numjobs=8 --time_based --runtime=120 --group_reporting
nvme_profile_mounted: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.36
 Starting 8 processes
Jobs: 8 (f=8): [m(8)][100.0%][r=75.1MiB/s,w=32.8MiB/s][r=19.2k,w=8401 IOPS][eta 00m:00s]
nvme_profile_mounted: (groupid=0, jobs=8): err= 0: pid=58215: Wed Jun 10 12:51:05 2026
  read: IOPS=17.8k, BW=69.6MiB/s (73.0MB/s)(8350MiB/120002msec)
    slat (usec): min=3, max=274220, avg= 6.66, stdev=390.67
    clat (usec): min=1251, max=299570, avg=19318.13, stdev=9600.08
     lat (usec): min=1257, max=299576, avg=19324.79, stdev=9608.25
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   12], 10.00th=[   14], 20.00th=[   16],
     | 30.00th=[   17], 40.00th=[   18], 50.00th=[   19], 60.00th=[   20],
     | 70.00th=[   21], 80.00th=[   23], 90.00th=[   26], 95.00th=[   28],
     | 99.00th=[   37], 99.50th=[   49], 99.90th=[  114], 99.95th=[  271],
     | 99.99th=[  292]
   bw (  KiB/s): min=43336, max=87960, per=99.99%, avg=71244.49, stdev=887.36, samples=1912
   iops        : min=10834, max=21990, avg=17811.12, stdev=221.84, samples=1912
  write: IOPS=7645, BW=29.9MiB/s (31.3MB/s)(3584MiB/120002msec); 0 zone resets
    slat (usec): min=7, max=275144, avg=1022.02, stdev=1766.00
    clat (usec): min=299, max=300681, avg=20909.53, stdev=9933.26
     lat (usec): min=1256, max=301644, avg=21931.55, stdev=10152.26
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   14], 10.00th=[   15], 20.00th=[   17],
     | 30.00th=[   18], 40.00th=[   20], 50.00th=[   21], 60.00th=[   22],
     | 70.00th=[   23], 80.00th=[   24], 90.00th=[   27], 95.00th=[   30],
     | 99.00th=[   41], 99.50th=[   55], 99.90th=[  121], 99.95th=[  275],
     | 99.99th=[  292]
   bw (  KiB/s): min=19584, max=36264, per=99.97%, avg=30573.59, stdev=321.60, samples=1912
   iops        : min= 4896, max= 9066, avg=7643.40, stdev=80.40, samples=1912
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.23%, 10=1.97%, 20=56.33%, 50=40.96%
  lat (msec)   : 100=0.36%, 250=0.08%, 500=0.07%
  cpu          : usr=0.71%, sys=93.12%, ctx=224014, majf=0, minf=106
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=2137556,917451,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=69.6MiB/s (73.0MB/s), 69.6MiB/s-69.6MiB/s (73.0MB/s-73.0MB/s), io=8350MiB (8755MB), run=120002-120002msec
  WRITE: bw=29.9MiB/s (31.3MB/s), 29.9MiB/s-29.9MiB/s (31.3MB/s-31.3MB/s), io=3584MiB (3758MB), run=120002-120002msec

Disk stats (read/write):
  nvme0n1: ios=106015/920013, sectors=848120/8211144, merge=0/106064, ticks=4001/79595, in_queue=83652, util=11.60%